Revit 2027 API
BuiltInFailures.CreationFailures.CannotCreateGutterError Property
 Could not create Gutter. [Description]
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCreateGutterError { get; }
Public Shared ReadOnly Property CannotCreateGutterError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCreateGutterError {
	FailureDefinitionId^ get ();
}
static member CannotCreateGutterError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CreationFailures Class
Autodesk.Revit.DB Namespace